# PlumbingFixturesHwConnection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlumbingFixturesHwConnection Property
ParameterTypeId Class See Also
---
"HW Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlumbingFixturesHwConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlumbingFixturesHwConnection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlumbingFixturesHwConnection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace